uhnp/src/Reports/АнализТрансляцииПроводок/АнализТрансляцииПроводок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализТрансляцииПроводок</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКорректировки</name>
    <type>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументТрансляции</name>
    <type>
      <types>DocumentRef.Трансляция</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтПриемник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтПриемник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабПравилаВычисленияПараметров</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовИсточник</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНесопоставленные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтборПоляПриемник</name>
    <attributes>
      <name>ПолеБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>155</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоля</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

uhnp/src/Enums/СпособыВычисленияПараметровОперандов/СпособыВычисленияПараметровОперандов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВычисленияПараметровОперандов</name>
  <enumValues>
    <name>ПериодОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериодОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаПериодаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаПериодаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаПериодаОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаПериодаОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаГода</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаГода</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>АналогичныйПериодПредыдущегоГода</name>
  </enumValues>
  <enumValues>
    <name>АналогичныйПериодГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>ВалютаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериметрОтчета</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияОтчета</name>
  </enumValues>
  <enumValues>
    <name>НеПериметрОтчета</name>
  </enumValues>
  <enumValues>
    <name>СценарийОтчета</name>
  </enumValues>
  <enumValues>
    <name>СценарийФакта</name>
  </enumValues>
  <enumValues>
    <name>Аналитика1</name>
  </enumValues>
  <enumValues>
    <name>Аналитика2</name>
  </enumValues>
  <enumValues>
    <name>Аналитика3</name>
  </enumValues>
  <enumValues>
    <name>Аналитика4</name>
  </enumValues>
  <enumValues>
    <name>Аналитика5</name>
  </enumValues>
  <enumValues>
    <name>Аналитика6</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
  <enumValues>
    <name>СписокФиксированныхЗначений</name>
  </enumValues>
  <enumValues>
    <name>СписокПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>ОтборПоРеквизитамАналитики</name>
  </enumValues>
  <enumValues>
    <name>НеРавноФиксированномуЗначению</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеФиксированныхЗначений</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>ИнтервалПериодов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИ</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИЛИ</name>
  </enumValues>
  <enumValues>
    <name>ГруппаНЕ</name>
  </enumValues>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеСписокЗначений</name>
  </enumValues>
  <enumValues>
    <name>ПроектОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПроектОтчетаИерархия</name>
  </enumValues>
  <enumValues>
    <name>ВышестоящийПериод</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаВышестоящегоПериода</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаВышестоящегоПериода</name>
  </enumValues>
  <enumValues>
    <name>ИсходныйДокумент</name>
  </enumValues>
  <enumValues>
    <name>ТипЗначения</name>
  </enumValues>
  <enumValues>
    <name>СписокТиповЗначений</name>
  </enumValues>
  <enumValues>
    <name>СохраненнаяНастройкаОтбора</name>
  </enumValues>
  <enumValues>
    <name>НеПериодОтчета</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеЗначениеВладельца</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Reports/АнализТрансляцииПроводок/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мТаблицаПоказателейБД Экспорт;
Перем мТаблицаПроизводныхБД Экспорт;
Перем ТабличноеПолеИзмеренийБД Экспорт;
Перем мТабПравилаВычисленияПараметров Экспорт;

Перем ПравилаВычисленияПараметровЗапроса Экспорт;

// Описания типов
Перем мОписаниеТиповСтрока Экспорт;
Перем мОписаниеТиповБулево Экспорт;
Перем мОписаниеТиповТЗ Экспорт;
Перем мОписаниеТиповСписокЗначений Экспорт; 

Перем АдресХранилищаПеременныхДляРасчета Экспорт;

Перем ТекПравилаВычисленияПараметров Экспорт;
Перем ТекСоединениеВИБ;

Процедура ВосстановитьПеременныеДляРасчета(ПеременныеДляРасчета=Неопределено) Экспорт
	
	Если ПеременныеДляРасчета=Неопределено Тогда
		ПеременныеДляРасчета=ПолучитьИзВременногоХранилища(АдресХранилищаПеременныхДляРасчета);
	КонецЕсли;
	
	Если ТипЗнч(ПеременныеДляРасчета)=Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ПеременныеДляРасчета);
		
	КонецЕсли;
			
КонецПроцедуры // ВосстановитьПеременныеДляРасчета() 

Процедура ЗаполнитьДеревоПоРегиструБухгалтерии() Экспорт
	
	ТабличноеПолеИзмеренийБД = Новый ДеревоЗначений;
	ТабличноеПолеИзмеренийБД.Колонки.Добавить("НаименованиеБД"		, мОписаниеТиповСтрока);
	ТабличноеПолеИзмеренийБД.Колонки.Добавить("ПредставлениеПоля"	, мОписаниеТиповСтрока);
	ТабличноеПолеИзмеренийБД.Колонки.Добавить("ПолеБД"				, мОписаниеТиповСтрока);
	ТабличноеПолеИзмеренийБД.Колонки.Добавить("СправочникБД"   		, мОписаниеТиповСтрока);
	ТабличноеПолеИзмеренийБД.Колонки.Добавить("ТипМетаДанных" 		, мОписаниеТиповСтрока);
	ТабличноеПолеИзмеренийБД.Колонки.Добавить("ТипЗначения"			, мОписаниеТиповСписокЗначений);
	ТабличноеПолеИзмеренийБД.Колонки.Добавить("ТипДанныхПоля"		, мОписаниеТиповСписокЗначений);
		
	СписокИзмерений = мТаблицаПоказателейБД.НайтиСтроки(Новый Структура("Измерение, Дебетовый", Ложь, Истина));
	
	Для Каждого Элемент Из СписокИзмерений Цикл
				
		ТекущаяСтрока = ТабличноеПолеИзмеренийБД.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока,Элемент);
		
		Если (ТекущаяСтрока.ТипМетаДанных="Справочник" ИЛИ ТекущаяСтрока.ТипМетаДанных="Документ" ИЛИ ТекущаяСтрока.ТипМетаДанных="ПланВидовХарактеристик" ИЛИ ТекущаяСтрока.ТипЗначения.Количество()>1) Тогда 
			
			НоваяСтрока=ТекущаяСтрока.Строки.Добавить();
			
		КонецЕсли;
	
	КонецЦикла;
		
	СписокИзмерений = мТаблицаПоказателейБД.НайтиСтроки(Новый Структура("Измерение, Дебетовый", Ложь, Ложь));

	Для Каждого Элемент Из СписокИзмерений Цикл
				
		ТекущаяСтрока = ТабличноеПолеИзмеренийБД.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока,Элемент);
		
		Если (ТекущаяСтрока.ТипМетаДанных="Справочник" ИЛИ ТекущаяСтрока.ТипМетаДанных="Документ" ИЛИ ТекущаяСтрока.ТипМетаДанных="ПланВидовХарактеристик" ИЛИ ТекущаяСтрока.ТипЗначения.Количество()>1) Тогда 
			
			НоваяСтрока=ТекущаяСтрока.Строки.Добавить();
			
		КонецЕсли;
			
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьДеревоПоРегиструБухгалтерии()


Функция ПодготовитьСтруктуруПеременныхДляРасчета() Экспорт
		
	СтруктураПеременных=Новый Структура;
	СтруктураПеременных.Вставить("Ссылка");
	СтруктураПеременных.Вставить("РеквизитыОбъекта",				ОбщегоНазначенияУХ.ПолучитьСтруктуруРеквизитовОбъекта(ЭтотОбъект));
	СтруктураПеременных.Вставить("ПроцедураСозданияОбъекта","Отчеты.ОтчетПоРегиструБухгалтерииБД.Создать()");
	СтруктураПеременных.Вставить("мТаблицаПоказателейБД",			мТаблицаПоказателейБД);
	СтруктураПеременных.Вставить("мТаблицаПроизводныхБД",			мТаблицаПроизводныхБД);
	СтруктураПеременных.Вставить("ТабличноеПолеИзмеренийБД",		ТабличноеПолеИзмеренийБД);
	СтруктураПеременных.Вставить("мТабПравилаВычисленияПараметров",	мТабПравилаВычисленияПараметров);
	СтруктураПеременных.Вставить("ПравилаВычисленияПараметровЗапроса",ПравилаВычисленияПараметровЗапроса);
	
	Возврат СтруктураПеременных;
	
КонецФункции // ПодготовитьСтруктуруПеременныхДляРасчета()

Процедура УдалитьАналитикуПоСчету(Дебетовый) Экспорт
	
	// Удаление из таблицы показателей ВИБ.
	СписокУдаляемыхЭлементов = мТаблицаПоказателейБД.НайтиСтроки(Новый Структура("Измерение, Дебетовый", Ложь, Дебетовый));
	Для Каждого Элемент Из СписокУдаляемыхЭлементов Цикл
		мТаблицаПоказателейБД.Удалить(Элемент);
	КонецЦикла;
		
КонецПроцедуры

// Процедура добавляет в таблицу значений мТаблицаПоказателейБД данные по видам аналитики
// выбранного счета из плана счетов регистра бухгалтерии ВИБ.
// Параметр:
//  Дебетовый      - Булево, определяет, заполняются ли данные для дебетового или 
//                   кредитового счета.
//
Процедура ЗаполнитьАналитикуСчетаБД(Дебетовый = Истина) Экспорт	
	
	мТаблицаПроизводныхБД.Очистить();
	
	УдаляемыеСтроки = мТаблицаПоказателейБД.НайтиСтроки(Новый Структура("Измерение, Дебетовый", Ложь, Дебетовый));
	Для Каждого Элемент Из УдаляемыеСтроки Цикл
		мТаблицаПоказателейБД.Удалить(Элемент);
	КонецЦикла;
	
	ТекСчет = ?(Дебетовый, СчетДтИсточник, СчетКтИсточник);
	
	Если ТекСчет.ВидыСубконто.Количество()=0 Тогда
		ЕстьРазворотПоСубконто=Ложь;
		Возврат;
	Иначе
		ЕстьРазворотПоСубконто=Истина;
	КонецЕсли;
	
	ПризнакиУчетаСубконто=ОбщегоНазначенияУХ.РазложитьСтрокуВМассивПодстрок(ПланСчетовИсточник.ПризнакиУчетаСубконто,";");
	ТипБД=ПланСчетовИсточник.Владелец;
	
	Для Каждого ВидСубконто Из ТекСчет.ВидыСубконто Цикл
		
		СтрокаПоказателей                  = мТаблицаПоказателейБД.Добавить();
			
				
			СтрокаПоказателей.ПолеБД          = "Субконто"+?(Дебетовый,"Дт","Кт") + ВидСубконто.Номер;
			СтрокаПоказателей.НаименованиеБД          = НСтр("ru = 'Субконто'; en = 'Extra dimension';tr = 'Ekstra boyut'")+?(Дебетовый,Нстр("ru = 'Дт'; en = 'Dr';tr = 'Borç'"),Нстр("ru = 'Кт'; en = 'Cr';tr = 'Alacak'")) 
				+ ВидСубконто.Номер+": "+ВидСубконто.ВидСубконто;
			
		
		СтрокаПоказателей.ПредставлениеПоля = "["+СтрокаПоказателей.НаименованиеБД+"]";
		СтрокаПоказателей.Дебетовый        = Дебетовый;
		СтрокаПоказателей.ТолькоОбороты    = ВидСубконто.ТолькоОбороты;
		СтрокаПоказателей.Измерение        = Ложь;
		
		ТекПризнакиУчетаСубконто=Новый СписокЗначений;
		
		Для Каждого ПризнакУчетаСубконто ИЗ ПризнакиУчетаСубконто Цикл
			
			ТекПризнакиУчетаСубконто.Добавить(ПризнакУчетаСубконто,ПризнакУчетаСубконто, СтрНайти(ВидСубконто.ПризнакиУчетаСубконто,ПризнакУчетаСубконто)>0);
			
		КонецЦикла;
		
		СтрокаПоказателей.ПризнакиУчетаСубконто=ТекПризнакиУчетаСубконто;
		
		РаботаСПолямиАналитикиУХ.ЗаполнитьПоляТиповРеквизитовБД(СтрокаПоказателей, ВидСубконто.ТипДанных,ТипБД);
				
	КонецЦикла;
		
КонецПроцедуры   

Процедура ПолучитьСоединениеВИБ() Экспорт
	
	ТекСоединениеВИБ = РасширениеИнтеграцииУХ.ПолучитьСоединение(ИспользуемаяИБ, 1);
			
КонецПроцедуры // ПолучитьСоединениеВИБ()

Функция ПолучитьДопОтборыИсточник() Экспорт 
		
//	ДанныеРегистра	= ПолучитьДанныеРегистраБД();
	
	Если НЕ ПланСчетовИсточник.Владелец=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
		
		ПолучитьСоединениеВИБ();
		
		Если ТекСоединениеВИБ=Неопределено Тогда
			
			Возврат Новый Структура("РезультатЗаполнения",Новый ТабличныйДокумент);
			
		КонецЕсли;
		
		ПодготовитьТаблицуОтбораВИБ();
		
	Иначе
		
		ПравилаВычисленияПараметровЗапроса=мТабПравилаВычисленияПараметров.Скопировать();
			
		ТекСоединениеВИБ=РаботаСОбъектамиМетаданныхУХ.КонтекстМетаданных();
		
	КонецЕсли;
	
		
	////////////////////////////////////////////////////////////////////////////////////
	// Подготавливаем параметры для вызова обработки формирования отчета
	
		
	//ДанныеСчета		= ПолучитьДанныеСчетаБД(СчетДтИсточник);
	//ДанныеКоррСчета	= ПолучитьДанныеСчетаБД(СчетКтИсточник);

	ИспользуемыеПараметры			= ?(ПланСчетовИсточник.Владелец=Справочники.ТипыБазДанных.ТекущаяИБ ,ПодготовитьТаблицуПараметровТек(),ПодготовитьТаблицуПараметровВИБ());
	
	СформироватьПредставлениеПараметров(ИспользуемыеПараметры);		
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("ИспользуемыеПараметры",ИспользуемыеПараметры);
	СтруктураПараметров.Вставить("ТекстОтбораИсточник","");
	НастройкаУниверсальныхОтчетовПоРегистрамУХ.СформироватьТекстОтбораИтог(СтруктураПараметров);
	
	Возврат СтруктураПараметров
	
КонецФункции // ПолучитьДопОтборыИсточник() 

Процедура ПодготовитьТаблицуОтбораВИБ()
		
	ПравилаВычисленияПараметровЗапроса=мТабПравилаВычисленияПараметров.Скопировать();
	ПравилаВычисленияПараметровЗапроса.Колонки.Удалить("УточнениеСпособаОпределения");
	ПравилаВычисленияПараметровЗапроса.Колонки.Добавить("УточнениеСпособаОпределения");
	ПравилаВычисленияПараметровЗапроса.Колонки.Добавить("ТипРасчета");	
			
	Для Каждого СтрокаТаблицы Из мТабПравилаВычисленияПараметров Цикл

		Если СтрокаТаблицы.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеИспользуется Тогда
						
			Продолжить;
			
		КонецЕсли;
		
		Если СтрНайти(СтрокаТаблицы.ПолеБД,"Дт")=0 
			И СтрНайти(СтрокаТаблицы.ПолеБД,"Кт")=0
			И Лев(СтрокаТаблицы.ПолеБД,СтрДлина("Субконто"))="Субконто" Тогда
			
			ПолеПараметра=СтрЗаменить(СтрокаТаблицы.ПолеБД,"Субконто","СубконтоДт");
			
		Иначе
			
			ПолеПараметра=СтрокаТаблицы.ПолеБД;
			
		КонецЕсли;
				
		СтрокаПараметров=ПравилаВычисленияПараметровЗапроса.Найти(СтрокаТаблицы.ИмяПараметра,"ИмяПараметра");	
		ТекПараметрВИБ=НайтиСтрокуДанныхВИБПоПолю(ПолеПараметра);
				
		Если СтрокаПараметров=Неопределено Тогда
			
			СтрокаПараметров=ПравилаВычисленияПараметровЗапроса.Найти(ТекПараметрВИБ.ПолеБД,"ПолеБД");
			
			Если СтрокаПараметров=Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
						
		КонецЕсли;
		
		НастройкаСоответствия = СтрокаТаблицы.НастройкаСоответствия;		
		СтрокаПараметров.НастройкаСоответствия=НастройкаСоответствия;
		СтрокаПараметров.ТипРасчета="Простой";
		
		ТекЭлементВИБ   = ТекПараметрВИБ.СправочникБД;	
		
		Если ТекПараметрВИБ.ТипМетаДанных="Простой" Тогда
			
			СтрокаПараметров.УточнениеСпособаОпределения=Новый ХранилищеЗначения(СтрокаТаблицы.УточнениеСпособаОпределения);
		
		ИначеЕсли Не ПустаяСтрока(НастройкаСоответствия) Тогда // Отбор осуществляется по значению справочника Консолидации
			
			СтрокаПараметров.УточнениеСпособаОпределения=Новый ХранилищеЗначения(СтрокаТаблицы.УточнениеСпособаОпределения);
			
		Иначе // Отбор осуществляется по значению справочника внешней информационной базы.
			
			Если ТипЗнч(СтрокаТаблицы.УточнениеСпособаОпределения)=Тип("Структура") Тогда
				
				СтрокаПараметров.УточнениеСпособаОпределения = Новый ХранилищеЗначения(СтрокаТаблицы.УточнениеСпособаОпределения);
				
			Иначе
			
			Если ТипЗнч(СтрокаТаблицы.УточнениеСпособаОпределения)=Тип("СписокЗначений") Тогда
				
				СписокЗначений = СтрокаТаблицы.УточнениеСпособаОпределения;
				
			Иначе
				
				СписокЗначений=Новый СписокЗначений;
				СписокЗначений.Добавить(СтрокаТаблицы.УточнениеСпособаОпределения);
				
			КонецЕсли;
			
			Если ПустаяСтрока(ТекЭлементВИБ) Тогда
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ОбъектМетаданных) Тогда
					
					ИспользуетсяПеречисление = СтрНайти(СтрокаТаблицы.ОбъектМетаданных,"Перечисление")>0;		
					СтруктураОтбора = Новый Структура("_Справочник", СтрокаТаблицы.ОбъектМетаданных);
					
				Иначе
					
					Продолжить;
					
				КонецЕсли;
				
			Иначе				
				
				ИспользуетсяПеречисление=(ТекПараметрВИБ.ТипМетаДанных="Перечисление");
				СтруктураОтбора = Новый Структура("_Справочник", ТекПараметрВИБ.ТипМетаДанных + "." + ТекЭлементВИБ);
								
			КонецЕсли;
				
			МассивЭлементаОтбора = Новый Массив;
			СтруктураОтбора.Вставить("МассивОтбора", МассивЭлементаОтбора);
			
			Если ЗначениеЗаполнено(СписокЗначений) Тогда
				
				КоличествоЗаписей = СписокЗначений.Количество();
				
				Если КоличествоЗаписей > 0 Тогда
					Если КоличествоЗаписей = 1 Тогда
						Если ИспользуетсяПеречисление Тогда
							МассивЭлементаОтбора.Добавить(Новый Структура("Ссылка", "ЗНАЧЕНИЕ(" + СписокЗначений[0].Значение + ")"));
							//МассивЭлементаОтбора.Добавить(Новый Структура("Enums", СписокЗначений[0].Значение));
						Иначе
							Если НЕ СписокЗначений[0].Пометка Тогда
								МассивЭлементаОтбора.Добавить(Новый Структура("Наименование", СписокЗначений[0].Представление));
							Иначе
								
								ОтборТек=Новый Структура;
								ОтборТек.Вставить("Наименование",СписокЗначений[0].Представление);
								
								МассивЭлементаОтбора.Добавить(ОтборТек);
								
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						
						Для Каждого Элемент Из СписокЗначений Цикл
							Если ИспользуетсяПеречисление Тогда
								МассивЭлементаОтбора.Добавить(Новый Структура("Ссылка", "ЗНАЧЕНИЕ(" + Элемент.Значение + ")"));
								//МассивЭлементаОтбора.Добавить(Новый Структура("Enums", Элемент.Значение));
							Иначе
								
								Если НЕ Элемент.Пометка  Тогда
									МассивЭлементаОтбора.Добавить(Новый Структура("Наименование", Элемент.Представление));
								Иначе
									
									ОтборТек=Новый Структура;
									ОтборТек.Вставить("Код",Элемент.Значение);
									ОтборТек.Вставить("Наименование",Элемент.Представление);
									
									МассивЭлементаОтбора.Добавить(ОтборТек);
									
								КонецЕсли;
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			СтрокаПараметров.УточнениеСпособаОпределения = Новый ХранилищеЗначения(СтруктураОтбора); 
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
		
	ТекПравилаВычисленияПараметров=РасширениеИнтеграцииУХ.ПолучитьРабочуюТаблицуВычисленияПараметров(ПравилаВычисленияПараметровЗапроса);	

КонецПроцедуры // ПодготовитьТаблицуОтбораВИБ()

Процедура СформироватьПредставлениеПараметров(ИспользуемыеПараметры)
	
	Для Каждого СтрокаПараметр ИЗ ИспользуемыеПараметры Цикл
		
		Если СтрокаПараметр.ИмяПараметра="ПланСчетов" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтрПравило=ТабПравилаВычисленияПараметров.Найти(СтрокаПараметр.ИмяПараметра,"ИмяПараметра");		
		СтрокаПараметр.ПредставлениеПараметра=УправлениеОтчетамиУХ.ПолучитьТекстОтбора(СтрПравило.УточнениеСпособаОпределения);	
		СтрокаПараметр.ИмяПараметра = СтрЗаменить(СтрокаПараметр.ИмяПараметра, ".", "");
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьПредставлениеПараметров()

Функция ПодготовитьТаблицуПараметровВИБ()
	
	ИспользуемыеПараметры = Новый ТаблицаЗначений;
	ИспользуемыеПараметры.Колонки.Добавить("ИмяПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("ЗначениеПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("КонструкцияОтбора");
	ИспользуемыеПараметры.Колонки.Добавить("ПолеБД"); 
	ИспользуемыеПараметры.Колонки.Добавить("ПредставлениеПоля");
	ИспользуемыеПараметры.Колонки.Добавить("СпособВычисленияПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("ПредставлениеПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("Вычислять",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	
	ВИБ=Новый Структура;
	ВИБ.Вставить("ВИБ",ИспользуемаяИБ);
	ВИБ.Вставить("ТипПодключения",1);
	
	Для Каждого СтрокаВычисления Из ТекПравилаВычисленияПараметров Цикл
		
		Если СтрокаВычисления.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеИспользуется Тогда
			Продолжить;
		КонецЕсли;		
		
		СтруктураОтбора  = УправлениеОтчетамиУХ.ПолучитьЗначениеИзХранилища(СтрокаВычисления.УточнениеСпособаОпределения);
		
		Если Не ЗначениеЗаполнено(СтруктураОтбора) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока=ИспользуемыеПараметры.Добавить();
		НоваяСтрока.ИмяПараметра				= СтрЗаменить(СтрокаВычисления.ИмяПараметра,".","");
		НоваяСтрока.КонструкцияОтбора			= ПолучитьКонструкциюОтбора(СтрокаВычисления);
		НоваяСтрока.ПолеБД						= СтрокаВычисления.ПолеБД;
		НоваяСтрока.СпособВычисленияПараметра   = XMLСтрока(СтрокаВычисления.СпособВычисленияПараметра);
		
		СтрПолеБД=НайтиСтрокуДанныхВИБПоПолю(СтрокаВычисления.ПолеБД);
		НоваяСтрока.ПредставлениеПоля=?(СтрПолеБД=Неопределено,СтрокаВычисления.ПолеБД,СтрПолеБД.ПредставлениеПоля);
		
		Если ТипЗнч(СтруктураОтбора) = Тип("Структура") Тогда
			
			ДанныеСправочника = Неопределено;
			МассивОтбора = Новый Массив;
			
			Если СтруктураОтбора.Свойство("_Справочник", ДанныеСправочника) Тогда
								
				СтруктураОтбора.Свойство("МассивОтбора", МассивОтбора);
				
				НоваяСтрока.ЗначениеПараметра  = РасширениеИнтеграцииУХ.ПолучитьСтруктуруОтбора(ДанныеСправочника,МассивОтбора,ИспользуемаяИБ);
																		
			ИначеЕсли СтруктураОтбора.Свойство("_Справочники", ДанныеСправочника) Тогда
								
				СтруктураОтбора.Свойство("МассивОтбора", МассивОтбора);
				НоваяСтрока.ЗначениеПараметра  = РасширениеИнтеграцииУХ.ПолучитьСтруктуруОтбора(ДанныеСправочника.СправочникБД,МассивОтбора,ИспользуемаяИБ);
																
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.ЗначениеПараметра   = СтруктураОтбора;	
					
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ИспользуемыеПараметры;
	
КонецФункции // ПодготовитьТаблицуПараметровВИБ()

Функция ПодготовитьТаблицуПараметровТек()
	
	ИспользуемыеПараметры = Новый ТаблицаЗначений;
	ИспользуемыеПараметры.Колонки.Добавить("ИмяПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("ЗначениеПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("КонструкцияОтбора");
	ИспользуемыеПараметры.Колонки.Добавить("ПолеБД");
	ИспользуемыеПараметры.Колонки.Добавить("ПредставлениеПоля");
	ИспользуемыеПараметры.Колонки.Добавить("СпособВычисленияПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("ПредставлениеПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("Вычислять",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	
	Для Каждого Параметр ИЗ ПравилаВычисленияПараметровЗапроса Цикл
		
		Если Параметр.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеИспользуется Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока=ИспользуемыеПараметры.Добавить();
		НоваяСтрока.ИмяПараметра				= Параметр.ИмяПараметра;
		НоваяСтрока.КонструкцияОтбора			= ПолучитьКонструкциюОтбора(Параметр);
		
		Если Параметр.ПолеБД="ПланСчетов" Тогда
			
			ИмяСправочника="ПланыСчетовМеждународногоУчета";
			НоваяСтрока.ЗначениеПараметра			= Справочники[ИмяСправочника].НайтиПоНаименованию(Параметр.УточнениеСпособаОпределения.Наименование);
			
		Иначе
			
			НоваяСтрока.ЗначениеПараметра			= Параметр.УточнениеСпособаОпределения;
			
		КонецЕсли;
		
		НоваяСтрока.ПолеБД						= Параметр.ПолеБД;
		НоваяСтрока.СпособВычисленияПараметра   = XMLСтрока(Параметр.СпособВычисленияПараметра);
		
		СтрПолеБД=НайтиСтрокуДанныхВИБПоПолю(Параметр.ПолеБД);
		НоваяСтрока.ПредставлениеПоля=?(СтрПолеБД=Неопределено,Параметр.ПолеБД,СтрПолеБД.ПредставлениеПоля);
	
	КонецЦикла;
	
	Возврат ИспользуемыеПараметры;
	
КонецФункции // ПодготовитьТаблицуПараметровТек() 

Функция НайтиСтрокуДанныхВИБПоПолю(ПолеБД) Экспорт;
	
	Если СтрНайти(ПолеБД,".")>0 Тогда
		Возврат мТаблицаПроизводныхБД.Найти(ПолеБД,"ПолеБД");
	Иначе
	    Возврат мТаблицаПоказателейБД.Найти(ПолеБД,"ПолеБД");
	КонецЕсли;
	
КонецФункции // НайтиСтрокуДанныхВИБПоПолю() 

Функция ОпределитьПолеОтбора(ПолеБД,СтрокаПараметр)
	
	Если СтрНайти(ПолеБД,"Субконто")=0 Тогда
		
		Возврат ПолеБД;
		
	ИначеЕсли СтрНайти(ПолеБД,".")=0 Тогда
		
		Если СтрокаПараметр.ТипЗначения.Количество()=1 Тогда
			
			Возврат "ВЫРАЗИТЬ ("+ПолеБД+" КАК "+СтрокаПараметр.ТипЗначения[0].Значение+")";
			
		КонецЕсли;
		
	Иначе
		
		МассивПутей=СтрРазделить(ПолеБД,".");
		
		СтрПоле=мТаблицаПоказателейБД.Найти(МассивПутей[0],"ПолеБД");
		
		Если (НЕ СтрПоле=Неопределено) И СтрПоле.ТипЗначения.Количество()=1 Тогда
			
			ТипЗначения= СтрПоле.ТипЗначения[0].Значение;
			
			МассивПутей[0]="ВЫРАЗИТЬ("+МассивПутей[0]+" КАК "+ТипЗначения+")";
			
			Возврат СтрСоединить(МассивПутей,".");	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПолеБД;
	
КонецФункции // ОпределитьПолеОтбора()

Функция ПолучитьКонструкциюОтбора(СтрокаПараметр)
	
	ИмяПараметра=СтрЗаменить(СтрокаПараметр.ИмяПараметра,".","");
	СпособВычисленияПараметра=СтрокаПараметр.СпособВычисленияПараметра;	
	
	ПолеПараметра=СтрокаПараметр.ПолеБД;
	ДанныеПараметра=НайтиСтрокуДанныхВИБПоПолю(ПолеПараметра);
	ПолеОтбора=ОпределитьПолеОтбора(ПолеПараметра,СтрокаПараметр);
	
	Если ДанныеПараметра=Неопределено Тогда
		
		Возврат ""
		
	КонецЕсли;
		
	Если ДанныеПараметра.ТипМетаДанных="Простой" Тогда
		
		Если СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение Тогда
			
			Возврат ПолеОтбора+" =&"+ИмяПараметра;
			
		ИначеЕсли СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеРавноФиксированномуЗначению Тогда
			
			Возврат ПолеОтбора+" <>&"+ИмяПараметра;
			
		ИначеЕсли СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений Тогда
			
			Возврат СтрШаблон(Нстр("ru = '%1 В(&%2)'; en = '%1 IN(&%2)';tr = '%1(&%2) de'"), ПолеОтбора, ИмяПараметра);
			
		ИначеЕсли СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеФиксированныхЗначений Тогда
			
			Возврат СтрШаблон(Нстр("ru = '(НЕ %1 В(&%2))'; en = '(NOT%1 IN(&%2))';tr = '(%1Değil (&%2)de)'"), ПолеОтбора, ИмяПараметра);
			
		КонецЕсли;
		
	Иначе
		
		Если СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение
			ИЛИ СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений Тогда
			
			Возврат СтрШаблон(Нстр("ru = '%1 В(&%2)'; en = '%1 IN(&%2)';tr = '%1(&%2) de'"), ПолеОтбора, ИмяПараметра);
			
		ИначеЕсли СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеРавноФиксированномуЗначению
			ИЛИ СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеФиксированныхЗначений Тогда
			
			Возврат СтрШаблон(Нстр("ru = '(НЕ %1 В(&%2))'; en = '(NOT%1 IN(&%2))';tr = '(%1Değil (&%2)de)'"), ПолеОтбора, ИмяПараметра);
			
		ИначеЕсли СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.СписокПоИерархии Тогда
			
			Возврат СтрШаблон(Нстр("ru = '%1 В ИЕРАРХИИ(&%2)'; en = '%1 IN HIERARCHY(&%2)';tr = '%1(&%2) HİYERARŞİSİNDE'"), ПолеОтбора, ИмяПараметра);
			
		ИначеЕсли СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии Тогда
			
			Возврат СтрШаблон(Нстр("ru = '(НЕ %1 В ИЕРАРХИИ(&%2))'; en = '(NOT %1 IN HIERARCHY(&%2))';tr = '(%1Değil (&%2) HİYERARŞİSİNDE)'"), ПолеОтбора, ИмяПараметра);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // ПолучитьКонструкциюОтбора()

мТаблицаПоказателейБД         = Новый ТаблицаЗначений;
мТаблицаПоказателейБД.Колонки.Добавить("ПолеБД",          	мОписаниеТиповСтрока);
мТаблицаПоказателейБД.Колонки.Добавить("НаименованиеБД",  	мОписаниеТиповСтрока);
мТаблицаПоказателейБД.Колонки.Добавить("ПредставлениеПоля",	мОписаниеТиповСтрока);
мТаблицаПоказателейБД.Колонки.Добавить("ТипЗначения",		мОписаниеТиповСписокЗначений);
мТаблицаПоказателейБД.Колонки.Добавить("ТипМетаДанных",    	мОписаниеТиповСтрока);
мТаблицаПоказателейБД.Колонки.Добавить("ТипДанныхПоля",		мОписаниеТиповСписокЗначений);
мТаблицаПоказателейБД.Колонки.Добавить("ТолькоОбороты",    	мОписаниеТиповБулево);
мТаблицаПоказателейБД.Колонки.Добавить("ПризнакиУчетаСубконто",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСписокЗначений());
мТаблицаПоказателейБД.Колонки.Добавить("Измерение",        	мОписаниеТиповБулево);
мТаблицаПоказателейБД.Колонки.Добавить("Дебетовый",        	мОписаниеТиповБулево);
мТаблицаПоказателейБД.Колонки.Добавить("СправочникБД",    	мОписаниеТиповСтрока);
мТаблицаПоказателейБД.Колонки.Добавить("Балансовый",       	мОписаниеТиповБулево);
мТаблицаПоказателейБД.Колонки.Добавить("ПризнакУчета",     	мОписаниеТиповСтрока);

мТаблицаПроизводныхБД=мТаблицаПоказателейБД.СкопироватьКолонки();

мОписаниеТиповСтрока=ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(500);
мОписаниеТиповБулево=ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево();
мОписаниеТиповТЗ=ОбщегоНазначенияУХ.ПолучитьОписаниеТиповТЗ();
мОписаниеТиповСписокЗначений=ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСписокЗначений();

ПолеСиноним=РаботаСОбъектамиМетаданныхУХ.ПолучитьПолеСиноним();



#КонецЕсли
